-- MySQL dump 10.13  Distrib 8.0.15, for Win64 (x86_64)
--
-- Host: localhost    Database: test
-- ------------------------------------------------------
-- Server version	8.0.15

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `products`
--

DROP TABLE IF EXISTS `products`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `products` (
  `Pid` int(11) NOT NULL AUTO_INCREMENT,
  `days` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `date` date NOT NULL,
  `price` int(11) NOT NULL,
  `available` int(11) NOT NULL,
  `total` int(11) NOT NULL,
  `travelagency` int(11) NOT NULL,
  `characteristics` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`Pid`)
) ENGINE=InnoDB AUTO_INCREMENT=81 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `products`
--

LOCK TABLES `products` WRITE;
/*!40000 ALTER TABLE `products` DISABLE KEYS */;
INSERT INTO `products` VALUES (1,5,'★冬季限定版★小資山東體驗~小合掌村、天鵝湖五天(無購物)','2019-03-09',12900,0,20,1,'晚去、晚回'),(2,5,'越來越嗨北越雙龍灣摩天輪五日遊(越捷四星版+購物)','2019-03-09',14999,20,20,1,'晚去'),(3,5,'越來越超值北越長安雙龍灣五日遊(越捷三星飯店+購物)','2019-03-09',15500,20,20,1,'晚去'),(4,5,'宿霧~雙跳島~輕鬆走4+1日遊-《二人成行-虎航》','2019-03-09',15900,16,16,1,'早去、早回'),(5,5,'宿霧~雙跳島●歐斯陸~超值4+1日遊-《二人成行-虎航》','2019-03-09',17900,16,16,1,'早去、早回'),(6,5,'驚喜泰越捷時尚遊艇五日【台中直飛】(泰越捷)','2019-03-09',18000,20,20,1,'晚去、早回'),(7,5,'越來越嗨北越雙龍灣海上VILLA五日遊(越捷四星+皇海號+購物)','2019-03-09',19500,20,20,1,'晚去'),(8,8,'★冬季版★攻略山東~觀天鵝、海鷗情緣8天(單飛)','2019-03-09',19900,0,16,1,'晚去、晚回'),(9,8,'★冬季版★攻略山東~觀天鵝、海鷗情緣8天(單飛)','2019-03-09',19900,0,21,1,'晚去、晚回'),(10,5,'愛SUN三亞乾靓海南五日','2019-03-09',20900,0,18,1,'晚去'),(11,5,'宿霧~薄荷島●歐斯陸~全覽4+1日遊-《二人成行-虎航》','2019-03-09',22900,16,16,1,'早去、早回'),(12,5,'【泰航】玩泰瘋奇幻島五日','2019-03-09',23000,20,20,1,'晚去、晚回'),(13,5,'【泰航】泰奢華五星半島五日（全程無購物）','2019-03-09',28000,20,20,1,'晚去、晚回'),(14,11,'【土耳其】探索番紅花城神秘驚奇熱氣球之旅11日-QR卡達航空','2019-03-09',29900,0,33,1,'晚去、晚回'),(15,12,'【西班牙、葡萄牙】聖家堂＆米拉之家~海之角洛卡岬12日-馬德里進/巴塞隆納出','2019-03-09',49900,0,42,1,'晚去'),(16,8,'【送小費】魅力歐洲~荷比法8日~梵谷國家公園凡爾賽萊茵雙遊船','2019-03-09',52900,0,21,1,'晚去、早回'),(17,5,'韓國玩粉大~愛寶樂園、小法國村、亂打秀、旗艦美食長腳蟹吃到飽五日【保證不上攝影】','2019-03-10',12900,0,18,1,'晚去、早回'),(18,6,'享戀泰國~時尚遊艇夜遊湄南河、168水流蝦燒烤六天【台中】','2019-03-10',16900,20,20,1,'晚去、早回'),(19,8,'山東~小歐洲風情.膠東半島.青島漫遊8天','2019-03-10',17900,17,18,1,'晚去、晚回'),(20,6,'帝寶泰國情緣~人妖秀VIP、黃金海岸人魚灣、360度環景高空酒吧、水上市場、時尚遊艇、泰式指壓六天【台中直飛】(泰越捷)','2019-03-10',19900,20,20,1,'晚去、早回'),(21,8,'★冬季版★攻略山東~觀天鵝、海鷗情緣8天(單飛)','2019-03-10',19900,0,16,1,'晚去、晚回'),(22,6,'宿霧~薄荷●雙跳島●歐斯陸~超值5+1日-《二人成行-虎航》','2019-03-10',22900,14,16,1,'早去、早回'),(23,5,'京阪神+奈良四都精緻休閒五日-台虎','2019-03-10',23900,0,13,1,'晚去、晚回'),(24,8,'印度傳奇~印度金三角.泰姬瑪哈陵.貴族皇宮.瑜珈體驗8天','2019-03-10',39900,17,18,1,'早去'),(25,7,'【哈吉假期】銀色烏茲別克斯坦.伊斯蘭風情高鐵七日','2019-03-10',59900,15,16,1,'晚去'),(26,5,'越來越超值北越長安雙龍灣五日遊(越捷三星飯店+購物)','2019-03-11',15500,20,20,1,'晚去'),(27,5,'越來越嗨北越雙龍灣摩天輪五日遊(越捷四星版+購物)','2019-03-11',16500,20,20,1,'晚去'),(28,4,'中國世家~璀璨澳門-港珠澳大橋.歡樂海洋王國.大三巴豪華4天','2019-03-11',18900,16,16,1,'晚去、晚回'),(29,5,'越來越嗨北越雙龍灣海上VILLA五日遊(越捷四星+皇海號+購物)','2019-03-11',19500,20,20,1,'晚去'),(30,4,'沖繩兜兜風～恐龍森林公園、海洋博、奇岩萬座毛、琉球體驗四日','2019-03-11',19900,0,10,1,'晚去、晚回'),(31,5,'「越來越好玩」深度風情北越長安雙龍灣五日(四星飯店)(華信)','2019-03-11',20200,0,20,1,'早去、早回'),(32,5,'菲要好玩～歐斯陸鯨鯊、薄荷島、雙跳島5日遊-長榮《六人成行》','2019-03-11',25500,16,16,1,'早去、早回'),(33,5,'菲要好玩～歐斯陸鯨鯊、墨寶沙丁魚風暴5日遊-長榮《六人成行》','2019-03-11',27000,16,16,1,'早去、早回'),(34,5,'菲要好玩～豪華歐斯陸5日-長榮《六人成行》','2019-03-11',29000,16,16,1,'早去、早回'),(35,10,'【奧地利、捷克】愛戀雙國.湖區.溫泉.古堡.音樂之都10-市場最超值','2019-03-11',39900,0,82,1,'晚去、早回'),(36,5,'★冬季限定版★小資山東體驗~小合掌村、天鵝湖五天(無購物)','2019-03-12',12900,0,32,1,'晚去、晚回'),(37,6,'宿霧~雙跳島~輕鬆走5+1日遊-《二人成行-虎航》','2019-03-12',17500,16,16,1,'早去、早回'),(38,8,'寧夏風情~賀蘭山.須彌山石窟.沙漠.送烤全羊8天','2019-03-12',22900,0,17,1,'晚去'),(39,6,'宿霧~薄荷●雙跳島●歐斯陸~超值5+1日-《二人成行-虎航》','2019-03-12',23500,16,16,1,'早去、早回'),(40,5,'最美長灘～悠閒五日--宿霧太平洋航空','2019-03-12',24200,4,6,1,'早去、晚回'),(41,5,'\r【亞洲航空】清邁自由行5天-精選酒店(含稅)\r','2019-03-09',13500,20,20,2,'早去、晚回'),(42,10,'\r銀色克斯波雙5星雙堡雙國家公園OUTLET10天\r','2019-03-09',59900,31,32,2,'晚去、晚回'),(43,11,'\r春夏奧捷斯匈東歐四國全覽11天\r','2019-03-10',54900,0,24,2,'晚去、早回'),(44,5,'\r大阪自由行5日-樂桃航空\r','2019-03-11',15000,10,10,2,''),(45,7,'\r雙城夢幻極光5+1晚3次遇見極光\r','2019-03-12',29900,4,4,2,''),(46,8,'\r一起牽手遊西班牙昆卡聖家堂OUTLET8天\r','2019-03-12',43900,0,27,2,'晚去'),(47,11,'\rCiao!義起玩、五漁村、威尼斯、OUELET11天\r','2019-03-12',54900,0,35,2,'晚去、早回'),(48,10,'\r【直飛】冬季Ciao起來!義大利10天\r','2019-03-12',72900,0,26,2,'早去、早回'),(49,4,'\r【亞洲航空】清邁自由行4天-精選酒店(含稅)\r','2019-03-14',12500,20,20,2,'早去、晚回'),(50,6,'\r初戀幸福極光4+1晚4次遇見極光\r','2019-03-14',26900,4,4,2,'早去、晚回'),(51,5,'\r汶萊五星帝國酒店．長鼻猴生態５天\r','2019-03-14',28300,15,16,2,'早去、晚回'),(52,5,'\r汶萊五星帝國酒店．烏魯淡武廊國家公園５天\r','2019-03-14',32800,8,16,2,'早去、晚回'),(53,5,'\r【前16名收訂優惠1000】三方五湖雪唯美‧美山合掌村.天橋立.越前冬旅五日\r','2019-03-14',35900,27,28,2,'早去、晚回'),(54,11,'\r探索約旦埃及～飄浮死海佩特拉悠閒紅海金字塔11天\r','2019-03-14',69900,0,22,2,'晚去、晚回'),(55,5,'\r【前16名收訂優惠1000】三方五湖雪唯美‧美山合掌村.天橋立.越前冬旅五日\r','2019-03-15',35900,27,28,2,'晚去、晚回'),(56,9,'\r馬航-珍愛斯里蘭卡全覽9日\r','2019-03-15',63900,19,20,2,'晚去、晚回'),(57,10,'\r西班牙七大城聖家堂佛朗明哥晚餐秀10日\r','2019-03-15',63900,0,26,2,'早去、早回'),(58,10,'\r西葡雙國巴塞隆納全覽10天(一內陸段飛機)\r','2019-03-15',66900,0,26,2,'早去、早回'),(59,6,'\r小資奇幻極光4+1晚2次遇見極光\r','2019-03-16',17900,4,4,2,'早去、早回'),(60,5,'\r迷戀沙巴美人魚島5日(2人成行)\r','2019-03-16',28000,15,16,2,'早去、早回'),(61,5,'\r【亞洲航空】清邁自由行5天-精選酒店(含稅)\r','2019-03-09',13500,20,20,2,'早去、晚回'),(62,10,'\r銀色克斯波雙5星雙堡雙國家公園OUTLET10天\r','2019-03-09',59900,31,32,2,'晚去、晚回'),(63,11,'\r春夏奧捷斯匈東歐四國全覽11天\r','2019-03-10',54900,0,24,2,'晚去、早回'),(64,5,'\r大阪自由行5日-樂桃航空\r','2019-03-11',15000,10,10,2,''),(65,7,'\r雙城夢幻極光5+1晚3次遇見極光\r','2019-03-12',29900,4,4,2,''),(66,8,'\r一起牽手遊西班牙昆卡聖家堂OUTLET8天\r','2019-03-12',43900,0,27,2,'晚去'),(67,11,'\rCiao!義起玩、五漁村、威尼斯、OUELET11天\r','2019-03-12',54900,0,35,2,'晚去、早回'),(68,10,'\r【直飛】冬季Ciao起來!義大利10天\r','2019-03-12',72900,0,26,2,'早去、早回'),(69,4,'\r【亞洲航空】清邁自由行4天-精選酒店(含稅)\r','2019-03-14',12500,20,20,2,'早去、晚回'),(70,6,'\r初戀幸福極光4+1晚4次遇見極光\r','2019-03-14',26900,4,4,2,'早去、晚回'),(71,5,'\r汶萊五星帝國酒店．長鼻猴生態５天\r','2019-03-14',28300,15,16,2,'早去、晚回'),(72,5,'\r汶萊五星帝國酒店．烏魯淡武廊國家公園５天\r','2019-03-14',32800,8,16,2,'早去、晚回'),(73,5,'\r【前16名收訂優惠1000】三方五湖雪唯美‧美山合掌村.天橋立.越前冬旅五日\r','2019-03-14',35900,27,28,2,'早去、晚回'),(74,11,'\r探索約旦埃及～飄浮死海佩特拉悠閒紅海金字塔11天\r','2019-03-14',69900,0,22,2,'晚去、晚回'),(75,5,'\r【前16名收訂優惠1000】三方五湖雪唯美‧美山合掌村.天橋立.越前冬旅五日\r','2019-03-15',35900,27,28,2,'晚去、晚回'),(76,9,'\r馬航-珍愛斯里蘭卡全覽9日\r','2019-03-15',63900,19,20,2,'晚去、晚回'),(77,10,'\r西班牙七大城聖家堂佛朗明哥晚餐秀10日\r','2019-03-15',63900,0,26,2,'早去、早回'),(78,10,'\r西葡雙國巴塞隆納全覽10天(一內陸段飛機)\r','2019-03-15',66900,0,26,2,'早去、早回'),(79,6,'\r小資奇幻極光4+1晚2次遇見極光\r','2019-03-16',17900,4,4,2,'早去、早回'),(80,5,'\r迷戀沙巴美人魚島5日(2人成行)\r','2019-03-16',28000,15,16,2,'早去、早回');
/*!40000 ALTER TABLE `products` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `travelagency`
--

DROP TABLE IF EXISTS `travelagency`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `travelagency` (
  `TAid` int(11) NOT NULL AUTO_INCREMENT,
  `TAname` varchar(100) NOT NULL,
  PRIMARY KEY (`TAid`),
  UNIQUE KEY `TAname_UNIQUE` (`TAname`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `travelagency`
--

LOCK TABLES `travelagency` WRITE;
/*!40000 ALTER TABLE `travelagency` DISABLE KEYS */;
INSERT INTO `travelagency` VALUES (1,'newamazing'),(2,'orangetour');
/*!40000 ALTER TABLE `travelagency` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping events for database 'test'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-03-09 11:19:30
